In [3]:
import pandas as pd
import numpy as np
import os

In [4]:
root = os.path.dirname(os.getcwd())
data_path = os.path.join('H:\\forcasting\\data\\raw',)
root, data_path

('H:\\forcasting', 'H:\\forcasting\\data\\raw')

In [5]:
sell_df = pd.read_csv(os.path.join(data_path,'sell_prices.csv'))
cal_df = pd.read_csv(os.path.join(data_path,'calendar.csv'))
sub_df = pd.read_csv(os.path.join(data_path,'sample_submission.csv'))

In [6]:
sell_df.head()

  store_id        item_id  wm_yr_wk  sell_price
0     CA_1  HOBBIES_1_001     11325        9.58
1     CA_1  HOBBIES_1_001     11326        9.58
2     CA_1  HOBBIES_1_001     11327        8.26
3     CA_1  HOBBIES_1_001     11328        8.26
4     CA_1  HOBBIES_1_001     11329        8.26

In [7]:
cal_df.head()

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,2011-01-29,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0
1,2011-01-30,11101,Sunday,2,1,2011,d_2,NaN,NaN,NaN,NaN,0,0,0
2,2011-01-31,11101,Monday,3,1,2011,d_3,NaN,NaN,NaN,NaN,0,0,0
3,2011-02-01,11101,Tuesday,4,2,2011,d_4,NaN,NaN,NaN,NaN,1,1,0
4,2011-02-02,11101,Wednesday,5,2,2011,d_5,NaN,NaN,NaN,NaN,1,0,1

In [8]:
sub_df.head()

,id,F1,F2,F3,F4,F5,F6,F7,F8,F9,...,F19,F20,F21,F22,F23,F24,F25,F26,F27,F28
0,HOBBIES_1_001_CA_1_validation,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,HOBBIES_1_002_CA_1_validation,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,HOBBIES_1_003_CA_1_validation,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,HOBBIES_1_004_CA_1_validation,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,HOBBIES_1_005_CA_1_validation,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [9]:
sell_df = pd.DataFrame(sell_df.groupby(['item_id','store_id'])['sell_price'].sum()).reset_index()
sell_df['id'] = sell_df['item_id'] +'_'+ sell_df['store_id'] + '_' + 'validation'

In [10]:
sell_df.head()

       item_id store_id  sell_price                           id
0  FOODS_1_001     CA_1      611.76  FOODS_1_001_CA_1_validation
1  FOODS_1_001     CA_2      611.76  FOODS_1_001_CA_2_validation
2  FOODS_1_001     CA_3      608.63  FOODS_1_001_CA_3_validation
3  FOODS_1_001     CA_4      611.76  FOODS_1_001_CA_4_validation
4  FOODS_1_001     TX_1      608.45  FOODS_1_001_TX_1_validation

In [11]:
root = os.path.dirname(os.getcwd())
data_path = os.path.join(root,'data','preprocessed','idmap.csv')
sell_df['id'].to_csv(data_path)

In [12]:
df = pd.read_csv(data_path,names=['idx','id'])
df.head()

   idx                           id
0    0  FOODS_1_001_CA_1_validation
1    1  FOODS_1_001_CA_2_validation
2    2  FOODS_1_001_CA_3_validation
3    3  FOODS_1_001_CA_4_validation
4    4  FOODS_1_001_TX_1_validation

In [13]:
df.tail()

         idx                               id
30485  30485  HOUSEHOLD_2_516_TX_2_validation
30486  30486  HOUSEHOLD_2_516_TX_3_validation
30487  30487  HOUSEHOLD_2_516_WI_1_validation
30488  30488  HOUSEHOLD_2_516_WI_2_validation
30489  30489  HOUSEHOLD_2_516_WI_3_validation

In [14]:
dates = pd.date_range(start='2011-01-29',end='2016-06-19').values

In [15]:
dates.shape

(1969,)

In [16]:
'pred_0.csv'.split('.')[0].split('_')[1]

'0'

In [51]:
temp = pd.read_csv('H:\\forcasting\\data\\predictions\\pred_0.csv').T

In [57]:
temp['idx'] = 'pred_0.csv'.split('.')[0].split('_')[1]
temp

,0,1,2,3,4,5,6,7,8,9,...,19,20,21,22,23,24,25,26,27,idx
yhat,6.029124,5.714743,6.0096,5.791,6.468251,5.167329,4.697475,4.912854,4.477528,4.677242,...,3.031889,2.786708,3.276268,3.148125,3.69141,3.765439,4.79059,3.851266,3.782304,0

In [53]:
np.log1p(6578.683726)

8.79174195720671

In [61]:
np.exp(0.030825760004061828) -2

-0.9686942064866628

In [54]:
log_val = np.log1p(temp.iloc[:,:-1].values.astype(float) + 1 )
log_val

array([[2.08307537, 2.04313317, 2.08064082, 2.05296918, 2.13632398,
        1.96953304, 1.90173056, 1.93338257, 1.8683389 , 1.89870497,
        1.85442911, 1.94982801, 1.74253902, 1.66062427, 2.45136712,
        1.64532446, 1.70464371, 1.67765329, 1.81863651, 1.61579548,
        1.56584293, 1.66321894, 1.63863258, 1.73895802, 1.75188122,
        1.91553782, 1.76665808, 1.75480214]])

In [56]:
# revert to exp

In [55]:
np.exp(log_val ) - 2

array([[6.02912354, 5.71474301, 6.00959997, 5.79099968, 6.46825088,
        5.16732882, 4.69747481, 4.91285397, 4.47752761, 4.6772416 ,
        4.38805036, 5.02747879, 3.71182746, 3.2625951 , 9.60420021,
        3.18269121, 3.49942595, 3.35297935, 4.16344891, 3.03188908,
        2.78670812, 3.27626751, 3.14812506, 3.69141   , 3.76543854,
        4.79058993, 3.85126617, 3.78230356]])

In [45]:
from joblib import Parallel,delayed
import time

In [92]:

def sqrt(x):
    val = x ** 0.5
    #print(val)
    return val

start = time.time()
Parallel(n_jobs=2) (delayed(sqrt) (i) for i in range(10))
end = time.time()
print('time taken: ',end - start)

time taken:  1.6467626094818115

In [89]:
start = time.time()
# for i in  range(10):
sqrt()
end = time.time()
print('time taken: ',end - start)

time taken:  0.0

In [4]:
import pickle

In [62]:
os.cpu_count()

4

In [6]:
from multiprocessing import Pool
import time
import os

In [7]:
def prime_factor(value):
    factors = []
    for divisor in range(2, value-1):
        quotient, remainder = divmod(value, divisor)
        if not remainder:
            factors.extend(prime_factor(divisor))
            factors.extend(prime_factor(quotient))
            break
        else:
            factors = [value]
    return factors

In [8]:
#pool = Pool(processes=os.cpu_count() -1)

In [1]:
params_grid =  {
                'growth' : ('linear','logistic'),
                'changepoint_prior_scale' : [0.3,0.7]
}

In [3]:
params_grid.__len__()

2